tap "dart-lang/dart"
tap "federico-terzi/espanso"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"
tap "puma/puma"
tap "sass/sass"
tap "thoughtbot/formulae"
tap "tomanthony/brews"

brew "awscli"
brew "bundler-completion"
brew "dnsmasq"
brew "editorconfig"
brew "gh"
brew "gist"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "htop"
brew "macvim", link: false
brew "mas"
brew "neovim"
brew "nginx", restart_service: true
brew "openjdk@8"
brew "pick"
brew "postgresql", restart_service: true
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "rbenv-bundler"
brew "redis", restart_service: true
brew "rename"
brew "ripgrep"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "youtube-dl"
brew "federico-terzi/espanso/espanso"
brew "puma/puma/puma-dev"
brew "thoughtbot/formulae/parity"
brew "thoughtbot/formulae/rcm"
brew "tomanthony/brews/itermocil"

cask "1password"
cask "airfoil"
cask "alfred"
cask "android-studio"
cask "backblaze"
cask "bartender"
cask "brave-browser"
cask "carbon-copy-cloner"
cask "choosy"
cask "chromedriver"
cask "discord"
cask "dropbox"
cask "fantastical"
cask "figma"
cask "firefox"
cask "firefox-developer-edition"
cask "font-andale-mono"
cask "font-bitstream-vera"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-hasklig"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-inconsolata"
cask "font-inter"
cask "font-lato"
cask "font-source-code-pro"
cask "fork"
cask "google-chrome"
cask "hazel"
cask "imageoptim"
cask "iterm2"
cask "kap"
cask "kindle"
cask "loom"
cask "minecraft"
cask "notion"
cask "numi"
cask "obsidian"
cask "openra"
cask "phantomjs"
cask "plex-media-player"
cask "raycast"
cask "sketch"
cask "skype"
cask "slack"
cask "steam"
cask "toggl-track"
cask "transmission"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wkhtmltopdf"
cask "zoom"

mas "1Blocker", id: 1365531024
mas "Banktivity", id: 1480779512
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "Drafts", id: 1435957248
mas "Gifwit", id: 871200983
mas "Harvest", id: 506189836
mas "Keynote", id: 409183694
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
mas "Mastonaut", id: 1450757574
mas "Medis", id: 1579200037
mas "NextDNS", id: 1464122853
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager", id: 451907568
mas "PDFOptim", id: 621276561
mas "Peek", id: 1554235898
mas "Pins", id: 1547106997
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Time Out", id: 402592703
mas "Timery", id: 1425368544
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
