tap "1password/tap"
tap "dart-lang/dart"
tap "federico-terzi/espanso"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "neovim/neovim"
tap "puma/puma"
tap "sass/sass"
tap "supabase/tap"
tap "thoughtbot/formulae"
tap "tomanthony/brews"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Improved top (interactive process viewer)
brew "htop"
# GUI for vim, made for macOS
brew "macvim", link: false
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Utility to choose one option from a set of choices
brew "pick"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Makes shims aware of bundle install paths
brew "rbenv-bundler"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Cross-platform Text Expander written in Rust
brew "federico-terzi/espanso/espanso"
# Supabase CLI
brew "supabase/tap/supabase"
# Shell commands for environment parity for Heroku apps
brew "thoughtbot/formulae/parity"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Sends audio from computer to outputs
cask "airfoil"
# Application launcher and productivity software
cask "alfred"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Data backup and storage service
cask "backblaze"
# Menu bar icon organiser
cask "bartender"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# E-books management software
cask "calibre"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# Open links in any browser
cask "choosy"
# Anthropic's official Claude AI desktop app
cask "claude"
# Screen capturing tool
cask "cleanshot"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Calendar software
cask "fantastical"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
cask "font-andale-mono"
cask "font-bitstream-vera"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-hasklig"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-inconsolata"
cask "font-inter"
cask "font-lato"
cask "font-source-code-pro"
# GIT client
cask "fork"
# App and website blocker
cask "freedom"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your emails and files
cask "gpg-suite"
# Automated organisation
cask "hazel"
# Tool to optimise images to a smaller size
cask "imageoptim"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Offline AI chat tool
cask "jan"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# Interface for reading and syncing eBooks
cask "kindle"
# Create, manage and debug system and user services
cask "launchcontrol"
# Screen and video recording software
cask "loom"
# Speech recognition tool
cask "macwhisper"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Scheduling application focusing on organisation
cask "omnifocus"
# Real-time strategy game engine for Westwood games
cask "openra"
# Headless web browser
cask "phantomjs"
# Home media player
cask "plex-media-player"
# Home media server
cask "plex-media-server"
# VPN client
cask "private-internet-access"
# List out the contents of a zip file in the QuickLook preview
cask "qlzipinfo"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# 3D CAD software
cask "shapr3d"
# Digital design and prototyping platform
cask "sketch"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Unpacks archive files
cask "the-unarchiver"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# To-do list
cask "todoist-app"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Wine wrapper built with SwiftUI
cask "whisky"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Actions For Obsidian", id: 1659667937
mas "Copilot", id: 1447330651
mas "Croissant", id: 6670288979
mas "DaisyDisk", id: 411643860
mas "Dato", id: 1470584107
mas "Day One", id: 1055511498
mas "Drafts", id: 1435957248
mas "HazeOver", id: 430798174
mas "Ivory", id: 6444602274
mas "Kindle", id: 302584613
mas "Noizio", id: 928871589
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 409201541
mas "Parcel", id: 375589283
mas "Peek", id: 1554235898
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 6475002485
mas "Tapestry", id: 6448078074
mas "Things", id: 904280696
mas "Timery", id: 1425368544
mas "To MP3 Converter 2", id: 983472324
mas "Toggl Track", id: 1291898086
mas "Wipr", id: 1662217862
vscode "akamud.vscode-theme-onedark"
vscode "andrejunges.handlebars"
vscode "astro-build.astro-vscode"
vscode "attilabuti.vscode-mjml"
vscode "azemoh.one-monokai"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "candidmetrics.ember-module-snippets"
vscode "castwide.solargraph"
vscode "chiragpat.vscode-glimmer"
vscode "clinyong.vscode-css-modules"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dhedgecock.ember-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "groksrc.ruby"
vscode "hashicorp.terraform"
vscode "hoovercj.ruby-linter"
vscode "hridoy.rails-snippets"
vscode "janisdd.vscode-edit-csv"
vscode "jxson.vscode-ember-test-runner"
vscode "karunamurti.rspec-snippets"
vscode "lifeart.vscode-ember-unstable"
vscode "lifeart.vscode-glimmer-syntax"
vscode "mechatroner.rainbow-csv"
vscode "miguel-savignano.ruby-symbols"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.theme-tomorrowkit"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "netcorext.uuid-generator"
vscode "octref.vetur"
vscode "pflannery.vscode-versionlens"
vscode "phanitejakomaravolu.emberes6snippets"
vscode "pkief.material-icon-theme"
vscode "pustelto.bracketeer"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "ronnidc.nunjucks"
vscode "rubymaniac.vscode-direnv"
vscode "shamrt.vscode-qunit-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sianglim.slim"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "sysoev.vscode-open-in-github"
vscode "timonwong.shellcheck"
vscode "typed-ember.glint-vscode"
vscode "usernamehw.errorlens"
vscode "vayan.haml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vortizhe.simple-ruby-erb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "walkme.ruby-extension-pack"
vscode "wmaurer.change-case"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
