tap "federico-terzi/espanso"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"
tap "puma/puma"
tap "thoughtbot/formulae"
tap "tomanthony/brews"

brew "awscli"
brew "b2-tools"
brew "bash-completion"
brew "bundler-completion"
brew "glib"
brew "certbot"
brew "cmake"
brew "ctags"
brew "dnsmasq"
brew "editorconfig"
brew "jpeg"
brew "gist"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "lua"
brew "highlight"
brew "htop"
brew "macvim"
brew "mas"
brew "mosh"
brew "neovim"
brew "nginx", restart_service: true
brew "nmap"
brew "offlineimap"
brew "openjdk@8"
brew "postgresql", restart_service: true
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "rbenv-bundler"
brew "redis", restart_service: true
brew "rename"
brew "ripgrep"
brew "sphinx-doc"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "vim", link: false
brew "watch"
brew "watchman"
brew "wget"
brew "youtube-dl"
brew "federico-terzi/espanso/espanso"
brew "puma/puma/puma-dev"
brew "thoughtbot/formulae/parity"
brew "thoughtbot/formulae/rcm"
brew "tomanthony/brews/itermocil"

cask "1password"
cask "airfoil"
cask "alfred"
cask "android-studio"
cask "arq"
cask "bartender"
cask "brave-browser"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "firefox-developer-edition"

cask "font-andale-mono"
cask "font-bitstream-vera"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-hasklig"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-inconsolata"
cask "font-inter"
cask "font-lato"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-source-code-pro"

cask "fork"
cask "gitup"
cask "google-chrome"
cask "gpg-suite"
cask "hazel"
cask "iconjar"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "java8"
cask "kap"
cask "keybase"
cask "keyboard-maestro"
cask "kindle"
cask "notion"
cask "numi"
cask "obsidian"
cask "openra"
cask "paw"
cask "phantomjs"
cask "plex-media-player"
cask "plex-media-server"
cask "psequel"
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "rescuetime"
cask "sequel-pro"
cask "sketch"
cask "skype"
cask "slack"
cask "steam"
cask "talon"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wkhtmltopdf"

mas "Annotate", id: 918207447
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "Drafts", id: 1435957248
mas "Duplicate Photos Fixer Pro", id: 963642514
mas "Fantastical", id: 975937182
mas "Gifwit", id: 871200983
mas "HazeOver", id: 430798174
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "MindNode", id: 1289197285
mas "Noizio", id: 928871589
mas "Note2Txt", id: 1103045981
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager", id: 451907568
mas "PDFOptim", id: 621276561
mas "Pixelmator", id: 407963104
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Time Out", id: 402592703
mas "Xcode", id: 497799835
